GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/GPIO/Inc/gpio_ll.h
/**
 * @file    gpio_ll.h
 * @author  Shrey Shah
 * @brief   GPIO Low-Level Hardware Instruction Layer
 * @version v1.2
 * @date    24-10-2025
 *
 * @details
 * This header defines the **Low Level (LL)** GPIO API for STM32F103C8T6.
 * All functions directly map to hardware registers (CRL/CRH/ODR/IDR/BSRR/BRR)
 * and provide atomic bit-level access.
 *
 * The file is modular by design:
 * - Core LL functions are always compiled.
 * - Optional commit/IRQ layers can be enabled via compile-time flags
 * 
 */

#ifndef GPIO_LL_H_
#define GPIO_LL_H_

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/*---------------------------------------------- Includes ----------------------------------------------*/
/** 
 * @brief For register mapping base types
 * @include Test
 */
#include "stm32f1xx.h"

// ######################################################################################################
// GPIO Register APIs
// ######################################################################################################

/**
 * @defgroup GPIO_01_Registers GPIO Registers
 * @ingroup GPIO
 * @brief GPIO Registers
 * @{
 */

/**
 * @defgroup GPIO_01_Registers_04_API GPIO Register Access APIs
 * @ingroup GPIO_01_Registers
 * @brief APIs to access @ref 01_GPIO_01_Registers_Structure "GPIO Registers"
 * @{
 */

/*---------------------------------------------- GPIO Configuration ----------------------------------------------*/
/**
 * @defgroup GPIO_01_Registers_04_API_01_CRx GPIO Configuration Register APIs
 * @ingroup GPIO_01_Registers_04_API
 * @brief Direct pin mode and configuration access (CRL/CRH)
 * @{
 */

/**
 * @brief 				Reads @ref GPIO_TypeDef_CRL "CRL"
 * @param[in] GPIOx		Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 * @returns				CRL
 * @ref GPIO_Pins_Summary "GPIO Pin Summary"
 */
__STATIC_FORCEINLINE uint32_t __GPIO_ReadCRL(const GPIO_TypeDef* const GPIOx)
{
	return (uint32_t) GPIOx->CRL.REG;
}

/**
 * @brief				Writes @ref GPIO_TypeDef_CRL "CRL"
 * @param[in] GPIOx		Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 * @param[in] value		Updated Value to be written
 * @ref GPIO_Pins_Summary "GPIO Pin Summary"
 */
__STATIC_FORCEINLINE void __GPIO_WriteCRL(GPIO_TypeDef* const GPIOx, const uint32_t value)
{
	GPIOx->CRL.REG = value;
}

/**
 * @brief				Reads @ref GPIO_TypeDef_CRH "CRH"
 * @param[in] GPIOx		Target GPIO port 
 * @returns				CRH
 * @ref GPIO_Pins_Summary "GPIO Pin Summary" 
 */
__STATIC_FORCEINLINE uint32_t __GPIO_ReadCRH(const GPIO_TypeDef* const GPIOx)
{
	return (uint32_t) GPIOx->CRH.REG;
}

/**
 * @brief				Writes @ref GPIO_TypeDef_CRH "CRH"
 * @param[in] GPIOx		Target GPIO port
 * @param[in] value		Updated Value to be written
 * @ref GPIO_Pins_Summary "GPIO Pin Summary"
 */
__STATIC_FORCEINLINE void __GPIO_WriteCRH(GPIO_TypeDef* const GPIOx, const uint32_t value)
{
	GPIOx->CRH.REG = value;
}

/** @} */ // GPIO_01_Registers_04_API_01_CRx

/*---------------------------------------------- GPIO Output Operations ----------------------------------------------*/
/**
 * @defgroup GPIO_01_Registers_04_API_02_Output GPIO Output APIs
 * @ingroup GPIO_01_Registers_04_API
 * @brief Output write operations
 * @{
 */

/**
 * @brief Writes an entire pattern to @ref GPIO_TypeDef_ODR "ODR"
 * @param[in] GPIOx Target GPIO port
 * @param[in] value 32-bit port output value
 */
__STATIC_FORCEINLINE void __GPIO_WriteODR(GPIO_TypeDef* const GPIOx, const uint32_t value)
{
	GPIOx->ODR.REG = value;
}

/**
 * @brief Writes an entire pattern to @ref GPIO_TypeDef_BSRR "BSRR"
 * @param[in] GPIOx Target GPIO port
 * @param[in] value 32-bit port output value
 */
__STATIC_FORCEINLINE void __GPIO_WriteBSRR(GPIO_TypeDef* const GPIOx, const uint32_t value)
{
	GPIOx->BSRR.REG = value;
}

/**
 * @brief Writes an entire pattern to @ref GPIO_TypeDef_BRR "BRR"
 * @param[in] GPIOx Target GPIO port
 * @param[in] value 32-bit port output value
 */
__STATIC_FORCEINLINE void __GPIO_WriteBRR(GPIO_TypeDef* const GPIOx, const uint32_t value)
{
	GPIOx->BRR.REG = value;
}

/** @} */ // GPIO_01_Registers_04_API_02_Output

/*---------------------------------------------- GPIO Input Operations ----------------------------------------------*/
/**
 * @defgroup GPIO_01_Registers_04_API_03_Input GPIO Input APIs
 * @ingroup GPIO_01_Registers_04_API
 * @brief Reads current input state from GPIO pins
 * @{
 */

/**
 * @brief Reads an entire pattern from IDR
 * @param[in] GPIOx Target GPIO port
 * @returns Status of GPIO Input
 */
__STATIC_FORCEINLINE uint32_t __GPIO_ReadIDR(const GPIO_TypeDef* const GPIOx)
{
	return (uint32_t)(GPIOx->IDR.REG);
}

/** @} */ // GPIO_01_Registers_04_API_03_Input

/*---------------------------------------------- GPIO Lock Operations ----------------------------------------------*/
/**
 * @defgroup GPIO_01_Registers_04_API_04_Lock GPIO Lock APIs
 * @ingroup GPIO_01_Registers_04_API
 * @brief Locks the state of GPIO pins until next reset
 * @{
 */

/**
 * @brief Writes an entire pattern to @ref GPIO_TypeDef_LCKR "LCKR"
 * @param[in] GPIOx Target GPIO port
 * @param[in] value 32-bit port output value 
 */
__STATIC_FORCEINLINE void __GPIO_WriteLCKR(GPIO_TypeDef* const GPIOx, const uint32_t value)
{
	GPIOx->LCKR.REG = value;
} 

/**
 * @brief Reads an entire pattern from @ref GPIO_TypeDef_LCKR "LCKR"
 * @param[in] GPIOx Target GPIO port
 */
__STATIC_FORCEINLINE uint32_t __GPIO_ReadLCKR(GPIO_TypeDef* const GPIOx)
{
	return (GPIOx->LCKR.REG);
} 

/** @} */ // GPIO_01_Registers_04_API_04_Lock

/** @} */ // GPIO_01_Registers_04_API

/** @} */ // GPIO_01_Registers

// ######################################################################################################
// GPIO Low Level APIs: LL
// ######################################################################################################

/**
 * @brief GPIO Low Level APIs
 * @defgroup GPIO_02_LL GPIO Low Level APIs
 * @ingroup GPIO
 * 
 * @{
 */

/*---------------------------------------------- GPIO LL Clock ----------------------------------------------*/
/**
 * @brief GPIO Low Level Clock APIs
 * @defgroup GPIO_02_LL_01_Clock GPIO LL Clock APIs
 * @ingroup GPIO_02_LL
 * @{
 */

/**
 * @brief Compute the RCC clock-enable bit position for a GPIO port
 *
 * @details
 * Determines the **relative bit position** of a GPIO port within `RCC->APB2ENR`
 * by calculating its offset from @ref GPIOA using @ref BIT_POS.
 *
 * The result provides a **zero-based index** for clock-enable bit positioning.
 * This is purely compile-time arithmetic — no hardware access occurs.
 *
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 *
 * @return Zero-based index of the GPIO port relative to GPIOA
 *
 * @see @ref BIT_POS
 * @see @ref _GPIO_EnableClock()
 * @see @ref _GPIO_DisableClock()
 *
 * @par Example:
 * @code
 * uint32_t pos = GPIO_CLK_POS(GPIOC);  // GPIOC → index 2
 * RCC->APB2ENR |= (1U << (RCC_APB2ENR_IOPAEN_Pos + pos));
 * @endcode
 * 
 * @def GPIO_CLK_POS
 */
#define GPIO_CLK_POS(GPIOx) 						BIT_POS((GPIOx), GPIOA, GPIO_TypeDef)

/**
 * @brief Compute the RCC clock-enable bitmask for a GPIO port
 *
 * @details
 * Generates the bitmask corresponding to a GPIO port’s enable bit in 
 * `RCC->APB2ENR` using @ref GPIO_CLK_POS to determine its bit position.
 *
 * This macro provides a ready-to-use mask for enabling or disabling
 * the clock for a specific GPIO port.
 *
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 *
 * @return Bitmask for the GPIO port’s clock-enable bit
 *
 * @see @ref GPIO_CLK_POS
 * @see @ref _GPIO_EnableClock()
 * @see @ref _GPIO_DisableClock()
 *
 * @par Example:
 * @code
 * // Enable GPIOB clock
 * RCC->APB2ENR |= GPIO_CLK_MASK(GPIOB);
 *
 * // Disable GPIOB clock
 * RCC->APB2ENR &= ~GPIO_CLK_MASK(GPIOB);
 * @endcode
 * 
 * @def GPIO_CLK_MASK
 */
#define GPIO_CLK_MASK(GPIOx) \
	((uint32_t) (0x01UL << (RCC_APB2ENR_IOPAEN_Pos + GPIO_CLK_POS(GPIOx))))

/**
 * @brief Enable GPIO Peripheral Clock
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 */
__STATIC_FORCEINLINE void _GPIO_EnableClock(const GPIO_TypeDef* const GPIOx)
{
	RCC->APB2ENR.REG |= GPIO_CLK_MASK(GPIOx);
}

/**
 * @brief Disable GPIO Peripheral Clock
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 */
__STATIC_FORCEINLINE void _GPIO_DisableClock(const GPIO_TypeDef* const GPIOx)
{
	RCC->APB2ENR.REG &= ~GPIO_CLK_MASK(GPIOx);
}

/** @} */ // GPIO_02_LL_01_Clock

