GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/GPIO/Inc/gpio_ll.h
/*---------------------------------------------- GPIO LL Pin ----------------------------------------------*/

/**
 * @brief GPIO Low Level Pin APIs
 * @defgroup GPIO_02_LL_02_Pin GPIO LL Pin APIs
 * @ingroup GPIO_02_LL
 * 
 * @{
 */

/**
 * @brief Creates a 32-bit mask for a single GPIO Pin
 *
 * This macro generates a bitmask where only the specified pin's bit is set
 * It is typically used for register operations like setting, clearing, or checking
 * the state of a single pin in a 16-pin port (0-15).
 *
 * @param pin The GPIO pin number (0-15) for which the mask should be created.
 * @return A 32-bit unsigned integer (\c uint32_t) with the bit corresponding to
 * the \p pin parameter set to '1', and all other bits set to '0'.
 * The mask is constrained to the lower 16 bits (0xFFFFUL).
 *
 * @note 
 * - This implementation assumes a standard 16-pin port structure, as it masks the result with \c 0xFFFFUL
 * - Pins greater than 15 will result in a mask of \c 0x0000UL due to the final AND operation
 *
 * @code
 * // Example usage:
 * uint32_t pin_mask = GPIO_PIN_MASK(5); // pin_mask will be 0x0020UL (0b100000)
 * @endcode
 * 
 * @def GPIO_PIN_MASK
 */
#define GPIO_PIN_MASK(pin)						((uint32_t)((0x01UL << (pin)) & 0xFFFFUL))

/**
 * @brief GPIO Pin Identifier Type
 * 
 * @details
 * Type-safe abstraction for GPIO pin identifiers. Using a typedef allows for
 * easy portability across different microcontroller architectures and future
 * enhancements without modifying function prototypes.
 * 
 * - **Current implementation**: `uint8_t` (0-255 range, supports up to 256 pins)
 * - **Future flexibility**: Can change to `uint16_t` for larger pin counts
 * - **Type safety**: Prevents accidental mixing with other integer types
 * - **Documentation clarity**: Self-documenting pin parameters
 * 
 * @note Changing the underlying type requires updating only this typedef and
 *       the pin constant definitions - all function signatures remain unchanged.
 * 
 * @example
 * @code
 * // Current usage (uint8_t based):
 * _gpio_pin_t led_pin = _GPIO_PIN_13;
 * _GPIO_SetPin(GPIOA, led_pin);
 * 
 * // Future usage (if changed to uint16_t):
 * // No code changes required in function calls!
 * @endcode
 */
typedef uint8_t _gpio_pin_t;

/** @brief GPIO Pin 0 @def _GPIO_PIN_0 */
#define _GPIO_PIN_0      ((_gpio_pin_t)0x00)
/** @brief GPIO Pin 1 @def _GPIO_PIN_1 */
#define _GPIO_PIN_1      ((_gpio_pin_t)0x01)
/** @brief GPIO Pin 2 @def _GPIO_PIN_2 */
#define _GPIO_PIN_2      ((_gpio_pin_t)0x02)
/** @brief GPIO Pin 3 @def _GPIO_PIN_3 */
#define _GPIO_PIN_3      ((_gpio_pin_t)0x03)
/** @brief GPIO Pin 4 @def _GPIO_PIN_4 */
#define _GPIO_PIN_4      ((_gpio_pin_t)0x04)
/** @brief GPIO Pin 5 @def _GPIO_PIN_5 */
#define _GPIO_PIN_5      ((_gpio_pin_t)0x05)
/** @brief GPIO Pin 6 @def _GPIO_PIN_6 */
#define _GPIO_PIN_6      ((_gpio_pin_t)0x06)
/** @brief GPIO Pin 7 @def _GPIO_PIN_7 */
#define _GPIO_PIN_7      ((_gpio_pin_t)0x07)
/** @brief GPIO Pin 8 @def _GPIO_PIN_8 */
#define _GPIO_PIN_8      ((_gpio_pin_t)0x08)
/** @brief GPIO Pin 9 @def _GPIO_PIN_9 */
#define _GPIO_PIN_9      ((_gpio_pin_t)0x09)
/** @brief GPIO Pin 10 @def _GPIO_PIN_10 */
#define _GPIO_PIN_10     ((_gpio_pin_t)0x0A)
/** @brief GPIO Pin 11 @def _GPIO_PIN_11 */
#define _GPIO_PIN_11     ((_gpio_pin_t)0x0B)
/** @brief GPIO Pin 12 @def _GPIO_PIN_12 */
#define _GPIO_PIN_12     ((_gpio_pin_t)0x0C)
/** @brief GPIO Pin 13 @def _GPIO_PIN_13 */
#define _GPIO_PIN_13     ((_gpio_pin_t)0x0D)
/** @brief GPIO Pin 14 @def _GPIO_PIN_14 */
#define _GPIO_PIN_14     ((_gpio_pin_t)0x0E)
/** @brief GPIO Pin 15 @def _GPIO_PIN_15 */
#define _GPIO_PIN_15     ((_gpio_pin_t)0x0F)

/**
 * @brief Set single pin (atomic)
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 * @param[in] pin Pin Number (0 - 15)
 * @details Uses BSRR for atomic set operation
 */
__STATIC_FORCEINLINE void _GPIO_SetPin(GPIO_TypeDef* const GPIOx, const _gpio_pin_t pin)
{
	__GPIO_WriteBSRR(GPIOx, GPIO_PIN_MASK(pin));
}

/**
 * @brief Reset a single pin (atomic)
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 * @param[in] pin Pin Number (0 - 15)
 * @details Uses BRR for atomic reset operation
 */
__STATIC_FORCEINLINE void _GPIO_ResetPin(GPIO_TypeDef* const GPIOx, const _gpio_pin_t pin)
{
	__GPIO_WriteBRR(GPIOx, GPIO_PIN_MASK(pin));
}

/**
 * @brief Toggle pin state
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 * @param[in] pin Pin Number (0 - 15)
 * @details Reads ODR via IDR, toggles, writes back to ODR
 */
__STATIC_FORCEINLINE void _GPIO_TogglePin(GPIO_TypeDef* const GPIOx, const _gpio_pin_t pin)
{
	__GPIO_WriteODR(GPIOx, (uint32_t)(__GPIO_ReadIDR(GPIOx) ^ GPIO_PIN_MASK(pin)));
}

/**
 * @brief Read pin state
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 * @param[in] pin Pin Number (0 - 15)
 * @returns State of pin:
 * @returns - `0x00`: Pin Reset
 * @returns - `0x01`: Pin Set
 */
__STATIC_FORCEINLINE uint8_t _GPIO_ReadPin(const GPIO_TypeDef* const GPIOx, const _gpio_pin_t pin)
{
	return (uint8_t) ((__GPIO_ReadIDR(GPIOx) & GPIO_PIN_MASK(pin)) ? 0x01 : 0x00);
}

/** @} */ // GPIO_02_LL_02_Pin


/**
 * @brief GPIO Low Level Pin APIs
 * @defgroup GPIO_02_LL_03_PinParams GPIO LL Pin Configuration APIs
 * @ingroup GPIO_02_LL
 * 
 * @{
 */

/**
 * @brief GPIO Mode Configuration Type
 * @section GPIO_LL_Mode GPIO LL Mode Macros
 * @details
 * Type-safe abstraction for GPIO mode and speed configuration. Using a typedef allows for
 * easy portability and future enhancements without modifying function prototypes.
 * 
 * - **Encapsulates**: MODE field in CRL/CRH registers
 * - **Current implementation**: `uint8_t` (0-3 range for 4 mode types)
 * - **Future flexibility**: Can extend range if new modes are added
 * - **Type safety**: Prevents accidental mixing with configuration types
 * - **Hardware mapping**: Directly maps to 2-bit MODE field in configuration registers
 * 
 * @note Changing the underlying type requires updating only this typedef and
 *       the mode constant definitions - all function signatures remain unchanged.
 * 
 * @example
 * @code
 * // Configure pin as output with 50MHz speed
 * _GPIO_SetMode(GPIOA, _GPIO_PIN_5, _GPIO_MODE_OUTPUT_50MHZ, _GPIO_CNF_OUTPUT_PP);
 * @endcode
 * 
 * @{
 */
/** @brief GPIO Mode LL Data Type @typedef _gpio_mode_t */
typedef uint8_t _gpio_mode_t;
/** @brief Input mode @def _GPIO_MODE_INPUT */
#define _GPIO_MODE_INPUT          ((_gpio_mode_t)0x00)
/** @brief Output mode, max speed 10 MHz @def _GPIO_MODE_OUTPUT_10MHZ */
#define _GPIO_MODE_OUTPUT_10MHZ   ((_gpio_mode_t)0x01)
/** @brief Output mode, max speed 2 MHz @def _GPIO_MODE_OUTPUT_2MHZ */
#define _GPIO_MODE_OUTPUT_2MHZ    ((_gpio_mode_t)0x02)
/** @brief Output mode, max speed 50 MHz @def _GPIO_MODE_OUTPUT_50MHZ */
#define _GPIO_MODE_OUTPUT_50MHZ   ((_gpio_mode_t)0x03)

/** @} */ // GPIO_LL_Mode

/**
 * @brief GPIO Configuration Type
 * @section GPIO_LL_Config GPIO LL Configuration Macros 
 * @details
 * Type-safe abstraction for GPIO electrical configuration. Using a typedef allows for
 * easy portability and future enhancements without modifying function prototypes.
 * 
 * - **Encapsulates**: CNF field in CRL/CRH registers  
 * - **Current implementation**: `uint8_t` (0-3 range for 4 configuration types)
 * - **Future flexibility**: Can extend range if new configurations are added
 * - **Type safety**: Prevents accidental mixing with mode types
 * - **Context dependent**: Interpretation depends on mode (input vs output)
 * - **Hardware mapping**: Directly maps to 2-bit CNF field in configuration registers
 * 
 * @note Interpretation depends on current mode setting:
 *       - Input mode: Analog/Floating/Pull configurations
 *       - Output mode: Push-pull/Open-drain configurations
 * 
 * @example
 * @code
 * // Configure pin as input with pull-up
 * _GPIO_SetMode(GPIOB, _GPIO_PIN_3, _GPIO_MODE_INPUT, _GPIO_CNF_INPUT_PULL);
 * @endcode
 * 
 * @{
 */
/** @brief GPIO Configuration LL Data Type @typedef _gpio_config_t */
typedef uint8_t _gpio_config_t;
/** @brief Input: Analog mode | Output: Push-pull @def _GPIO_CNF_INPUT_ANALOG */
#define _GPIO_CNF_INPUT_ANALOG    ((_gpio_config_t) 0x00)
/** @brief Input: Floating input | Output: Open-drain @def _GPIO_CNF_INPUT_FLOATING */
#define _GPIO_CNF_INPUT_FLOATING  ((_gpio_config_t) 0x01)
/** @brief Input: Pull-up/pull-down | Output: Alternate function push-pull @def _GPIO_CNF_INPUT_PULL */
#define _GPIO_CNF_INPUT_PULL      ((_gpio_config_t) 0x02)
/** @brief Input: Reserved | Output: Alternate function open-drain @def _GPIO_CNF_AF_OD */
#define _GPIO_CNF_AF_OD           ((_gpio_config_t) 0x03)

