GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/GPIO/Inc/gpio_ll.h
/** @} */ // GPIO_LL_Config

/**
 * @brief Set GPIO Pin Mode and Configuration
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 * @param[in] pin Pin Number (0-15)
 * @param[in] mode @ref GPIO_Pins_Mode "Mode Theory" | @ref GPIO_LL_Mode "GPIO LL Modes"
 * @param[in] config @ref GPIO_Pins_Config "Configuration Theory" | @ref GPIO_LL_Config "GPIO LL Configurations"
 * @see @ref GPIO_Pins_Summary "Summary of Configuration"
 */
__STATIC_FORCEINLINE void _GPIO_SetPinParams(GPIO_TypeDef* const GPIOx, const _gpio_pin_t pin, const _gpio_mode_t mode, const _gpio_config_t config)
{
	uint32_t reg = 0x00UL;
	uint8_t shift = ((pin & 0x07) << 2);  // (pin % 8) * 4
	
	// Pins 8-15: Use CRH
	if (pin & 0x08) 
	{
		reg = __GPIO_ReadCRH(GPIOx);
		reg = (reg & ~(0xFUL << shift)) | ((((uint32_t)config << 2) | mode) << shift);
		__GPIO_WriteCRH(GPIOx, reg);
	} 
	// Pins 0-7: Use CRL
	else 
	{
		reg = __GPIO_ReadCRL(GPIOx);
		reg = (reg & ~(0xFUL << shift)) | ((((uint32_t)config << 2) | mode) << shift);
		__GPIO_WriteCRL(GPIOx, reg);
	}
}

/**
 * @brief Reset GPIO Pin to default mode
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 * @param[in] pin Pin Number (0-15)
 * 
 * @note Sets the Pin to Input Floating State
 */
__STATIC_FORCEINLINE void _GPIO_ResetPinParams(GPIO_TypeDef* const GPIOx, const _gpio_pin_t pin)
{
    _GPIO_SetPinParams(GPIOx, pin, _GPIO_MODE_INPUT, _GPIO_CNF_INPUT_FLOATING);
}

/**
 * @brief Get GPIO Pin Configuration Register Value
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 * @param[in] pin Pin Number (0-15)
 * @return uint8_t 4-bit configuration value (CNF[1:0] | MODE[1:0])
 * @see @ref GPIO_Pins_Summary "Summary of Configuration"
 * 
 * @details
 * Retrieves the complete 4-bit configuration value for a specified GPIO pin
 * directly from the hardware registers. The returned value matches the exact
 * bit pattern stored in the CRL/CRH registers.
 * 
 * - **Bit 3:2**: CNF configuration field
 * - **Bit 1:0**: MODE configuration field  
 * 
 * @note The returned value can be directly compared with predefined constants
 *       or used for bit manipulation operations.
 * 
 */
__STATIC_FORCEINLINE uint8_t _GPIO_GetPinParams(const GPIO_TypeDef* const GPIOx, const _gpio_pin_t pin)
{
	uint32_t reg = 0x00UL;
	// Pins 8-15: Use CRH
	if (pin & 0x08) reg = __GPIO_ReadCRH(GPIOx);
	// Pins 0-7: Use CRL
	else reg = __GPIO_ReadCRL(GPIOx);
	reg >>= (pin & 0x07) << 2;
	return (uint8_t)(reg & 0x0FUL);
}

/**
 * @brief Get GPIO Pin Mode Configuration
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 * @param[in] pin Pin Number (0-15)
 * @return _gpio_mode_t @ref GPIO_LL_Mode "Pin Mode"
 * 
 * @details
 * Extracts the MODE field from the pin's configuration register.
 * Returns only the 2-bit mode value without the configuration bits.
 */
__STATIC_FORCEINLINE _gpio_mode_t _GPIO_GetPinMode(const GPIO_TypeDef* const GPIOx, const _gpio_pin_t pin)
{
    return ((_gpio_mode_t) (_GPIO_GetPinParams(GPIOx, pin) & 0x03));
}

/**
 * @brief Get GPIO Pin Configuration Type
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 * @param[in] pin Pin Number (0-15)
 * @return _gpio_config_t @ref GPIO_LL_Config "Pin Configuration"
 * 
 * @details
 * Extracts the CNF field from the pin's configuration register.
 * Returns only the 2-bit configuration value without the mode bits.
 */
__STATIC_FORCEINLINE _gpio_config_t _GPIO_GetPinConfig(const GPIO_TypeDef* const GPIOx, const _gpio_pin_t pin)
{
    return ((_gpio_config_t) ((_GPIO_GetPinParams(GPIOx, pin) >> 2) & 0x03));
}

/**
 * @brief Set GPIO Pin Mode Configuration
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 * @param[in] pin Pin Number (0-15)
 * @param[in] mode @ref GPIO_Pins_Mode "Mode Theory" | @ref GPIO_LL_Mode "GPIO LL Modes"
 * 
 * @details
 * Updates only the MODE field of the pin's configuration register
 * while preserving the existing CNF configuration bits.
 */
__STATIC_FORCEINLINE void _GPIO_SetPinMode(GPIO_TypeDef* const GPIOx, const _gpio_pin_t pin, const _gpio_mode_t mode)
{
    _GPIO_SetPinParams(GPIOx, pin, (mode & 0x03), _GPIO_GetPinConfig(GPIOx, pin));
}

/**
 * @brief Set GPIO Pin Configuration Type
 * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
 * @param[in] pin Pin Number (0-15)
 * @param[in] config @ref GPIO_Pins_Config "Configuration Theory" | @ref GPIO_LL_Config "GPIO LL Configurations"
 * 
 * @details
 * Updates only the CNF field of the pin's configuration register
 * while preserving the existing MODE bits.
 */
__STATIC_FORCEINLINE void _GPIO_SetPinConfig(GPIO_TypeDef* const GPIOx, const _gpio_pin_t pin, const _gpio_config_t config)
{
    _GPIO_SetPinParams(GPIOx, pin, _GPIO_GetPinMode(GPIOx, pin), (config & 0x03));
}

/** @} */ // GPIO_02_LL_03_PinParams

/**
 * @brief GPIO Low Level Lock APIs
 * @defgroup GPIO_02_LL_03_Lock GPIO LL Locking APIs
 * @ingroup GPIO_02_LL
 * 
 * @{
 */

/**
 * @brief GPIO Lock Status Type
 * @section GPIO_LL_Lock GPIO LL Lock Macros 
 * @details
 * Type-safe abstraction for GPIO lock operation results. Provides clear
 * status reporting for lock configuration operations without using enums.
 * 
 * - **0x00**: Lock operation completed successfully
 * - **0x01**: Lock operation failed (hardware verification failed)
 * - **0x02**: Lock is currently active and enforced
 * - **0x03**: Lock is not active or has been reset
 * 
 * @note Lock status is verified by reading back the LCKR register and
 *       checking the LCKK bit after the locking sequence completes.
 * 
 * @example
 * @code
 * _gpio_lock_status_t status = _GPIO_LockPin(GPIOA, _GPIO_PIN_5);
 * if (status == 0x00) 
 * {
 *     // Pin successfully locked until next reset
 * }
 * @endcode 
 * 
 */
typedef uint8_t _gpio_lock_status_t;

/** @brief Lock operation completed successfully @def _GPIO_LOCK_SUCCESS */
#define _GPIO_LOCK_SUCCESS									((_gpio_lock_status_t) 0x00)
/** @brief Lock operation failed @def _GPIO_LOCK_FAILED */
#define _GPIO_LOCK_FAILED									((_gpio_lock_status_t) 0x01)
/** @brief Lock is currently active @def _GPIO_LOCK_ENABLED */
#define _GPIO_LOCK_ENABLED									((_gpio_lock_status_t) 0x02)
/** @brief Lock is not active @def _GPIO_LOCK_DISABLED */
#define _GPIO_LOCK_DISABLED									((_gpio_lock_status_t) 0x03)


/**
 * @brief Lock GPIO pin configuration
 * @param[in] GPIOx Target GPIO Port
 * @param[in] pin Pin Number (0-15)
 * @return _gpio_lock_status_t Lock operation status
 * 
 * @details
 * Implements the hardware locking sequence to permanently protect GPIO pin
 * configuration until next system reset. The function follows the exact
 * sequence specified in the STM32F1 reference manual.
 * 
 * @locking_sequence
 * The function automatically performs:
 * 1. Write LCKR = (pin_mask | LCKK)  [LCKK = 1]
 * 2. Write LCKR = (pin_mask)          [LCKK = 0]  
 * 3. Write LCKR = (pin_mask | LCKK)  [LCKK = 1]
 * 4. Read LCKK bit to verify success
 * 
 * @warning Once locked, the pin configuration cannot be changed until
 *          the next system reset. Use this function with extreme caution.
 * 
 * @note Locking affects the entire port but only the specified pin's
 *       configuration is protected from modification.
 */
__STATIC_FORCEINLINE _gpio_lock_status_t _GPIO_LockPin(GPIO_TypeDef* const GPIOx, const _gpio_pin_t pin)
{
    const uint32_t lock_key = BIT_MASK(16) | BIT_MASK(pin);
    // Strict locking sequence per reference manual
    __GPIO_WriteLCKR(GPIOx, lock_key);
    __GPIO_WriteLCKR(GPIOx, (lock_key & ~BIT_MASK(16)));  
    __GPIO_WriteLCKR(GPIOx, lock_key);
    // Hardware verification
    return (__GPIO_ReadLCKR(GPIOx) & BIT_MASK(16)) ? _GPIO_LOCK_SUCCESS : _GPIO_LOCK_FAILED;
}

/**
 * @brief Check if GPIO pin configuration is locked
 * @param[in] GPIOx Target GPIO Port
 * @param[in] pin Pin Number (0-15)
 * @return _gpio_lock_status_t Lock status (_GPIO_LOCK_ENABLED or _GPIO_LOCK_DISABLED)
 * 
 * @details
 * Verifies whether a specific pin's configuration is currently locked by
 * checking both the global lock status (LCKK bit) and the individual pin's
 * lock bit in the LCKR register.
 * 
 * @note This function only checks the lock status - it does not attempt
 *       to modify or verify the actual pin configuration.
 */
__STATIC_FORCEINLINE _gpio_lock_status_t _GPIO_IsPinLocked(const GPIO_TypeDef* const GPIOx, const _gpio_pin_t pin)
{
    return (__GPIO_ReadLCKR(GPIOx) & (BIT_MASK(16) | BIT_MASK(pin))) ? _GPIO_LOCK_ENABLED : _GPIO_LOCK_DISABLED;
}

/** @} */ // GPIO_02_LL_03_Lock

/** @} */ // GPIO_02_LL

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* GPIO_LL_H_ */